Tekla Open API Reference for Tekla Structures 2025
Task.GetFathers Method
 Returns an enumerator of all the task type fathers for the task object.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ModelObjectEnumerator GetFathers()
Public Function GetFathers As ModelObjectEnumerator
Return Value
Type: ModelObjectEnumerator
A model object enumerator on success, otherwise null.
See Also
Reference
Task Class
Tekla.Structures.Model Namespace